test/load-test-github.yml
config:
  # This is a test server run by team Artillery
  # It's designed to be highly scalable
  target: https://henilmistry.github.io/AristaLabRequestor/
  phases:
    - duration: 100
      arrivalCount: 100
      name: Fixed Arrival
    - pause: 10
      name: Pause Phase
    - duration: 30
      arrivalRate: 5
      name: Constant Arrival
    - duration: 30
      arrivalRate: 5
      rampTo: 10
      maxVusers: 100
      name: Ramp up Phase (With Limit)
  # Load & configure a couple of useful plugins
  # https://artillery.io/docs/reference/extensions
  plugins:
    ensure:
      thresholds:
        - http.response_time.p99: 1000
        - http.response_time.p95: 750
    apdex:
      threshold: 100
    metrics-by-endpoint: {}
scenarios:
  - flow:
    - get:
        url: "/"