test/test-to-run-on-ci.yml
config:
  target: 'https://henilmistry.github.io/AristaLabRequestor/'
  # Creating 50vu/s for 2m and 30s
  phases:
    - duration: 150
      arrivalRate: 50
      name: Constant Arrival
  
  # Ensuring aggrigate max. latency is under 1s
  plugins:
    ensure:
      maxErrorRate: 1
      max: 1000
  
scenarios:
  - name: 'Connet to AristaLabRequestor'
    flow:
      - get:
          url: "/"
          expect:
            - statusCode: 200